OpenNuvoton/M55M1BSP/Library/UsbHostLib/src_core/usb_core.c
/**************************************************************************//**
 * @file     usb_core.c
 * @version  V1.00
 * @brief    USB Host library core driver.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "NuMicro.h"

#include "usb.h"
#include "hub.h"

/// @cond HIDDEN_SYMBOLS

USBH_T     *_ohci0;
USBH1_T    *_ohci1;
#ifdef ENABLE_EHCI
    HSUSBH_T   *_ehci;
#endif

int    _IsInUsbInterrupt = 0;

static UDEV_DRV_T   *_drivers[MAX_UDEV_DRIVER];

static CONN_FUNC  *g_conn_func, *g_disconn_func;

static int _ovc_active_high = 0;

/// @endcond HIDDEN_SYMBOLS
/**
  * @brief       Initialize USB Host controller and USB stack.
  *
  * @return      None.
  */
void  usbh_core_init()
{
#ifdef ENABLE_EHCI
    DISABLE_EHCI_IRQ();
#endif
#ifdef ENABLE_OHCI0
    DISABLE_OHCI0_IRQ();
#endif
#ifdef ENABLE_OHCI1
    DISABLE_OHCI1_IRQ();
#endif
#ifdef ENABLE_OHCI0//hydra...
    _ohci0 = USBH0;
#endif
#ifdef ENABLE_OHCI1//Synopsys...
    _ohci1 = USBH1;
#endif
#ifdef ENABLE_EHCI//Synopsys...
    _ehci = HSUSBH;
#endif

    memset(_drivers, 0, sizeof(_drivers));

    g_conn_func = NULL;
    g_disconn_func = NULL;

    usbh_hub_init();

    //_ehci->USBPCR0 = 0x160;                /* enable PHY 0          */
    //_ehci->USBPCR1 = 0x520;                /* enable PHY 1          */

    usbh_memory_init();
#ifdef ENABLE_OHCI0

    if (_ovc_active_high)
        _ohci0->HcMiscControl &= ~USBH_HcMiscControl_OCAL_Msk; /* Over-current active high */
    else
        _ohci0->HcMiscControl |= USBH_HcMiscControl_OCAL_Msk; /* Over-current active Low */

#endif

#if defined ENABLE_EHCI || defined ENABLE_OHCI1

    if (_ovc_active_high)
    {
        /* Over-current active high */
        HSOTG_SET_VBUS_OC_POL(HSOTG_VBUS_OC_VALID_HIGH);
        HSOTG_SET_VBUS_STS_POL(HSOTG_VBUS_ST_VALID_LOW);
    }
    else
    {
        /* Over-current active Low */
        HSOTG_SET_VBUS_OC_POL(HSOTG_VBUS_OC_VALID_LOW);
        HSOTG_SET_VBUS_STS_POL(HSOTG_VBUS_ST_VALID_HIGH);
    }

#endif
    //_ohci->HcMiscControl &= ~USBH_HcMiscControl_OCAL_Msk; /* Over-current active high */

#ifdef ENABLE_OHCI0
    ohci0_driver.init();
    USB_debug("OHCI0 init done.\n");
    ENABLE_OHCI0_IRQ();
#endif

#ifdef ENABLE_OHCI1
    ohci1_driver.init();
    USB_debug("OHCI1 init done.\n");
    ENABLE_OHCI1_IRQ();
#endif

#ifdef ENABLE_EHCI
    ehci_driver.init();
    USB_debug("EHCI init done.\n");
    ENABLE_EHCI_IRQ();
#endif
}

/**
 * @brief       Initialize USB Host controller and USB stack.
 *
 * @param[in]   ovc_alv   Over-current active level setting
 *                        0: active low
 *                        1: active high
 * @return      None.
 */
void  usbh_core_init_ex(int ovc_alv)
{
    _ovc_active_high = ovc_alv;
    usbh_core_init();
}

/**
  * @brief    Install device connect and disconnect callback function.
  *
  * @param[in]  conn_func       Device connect callback function.
  * @param[in]  disconn_func    Device disconnect callback function.
  * @return     None.
  */
void usbh_install_conn_callback(CONN_FUNC *conn_func, CONN_FUNC *disconn_func)
{
    g_conn_func = conn_func;
    g_disconn_func = disconn_func;
}

static int  reset_device(UDEV_T *udev)
{
    if (udev->parent == NULL)
    {
        if (udev->hc_driver)
            return udev->hc_driver->rthub_port_reset(udev->port_num - 1);
        else
            return USBH_ERR_NOT_FOUND;
    }
    else
    {
        return udev->parent->port_reset(udev->parent, udev->port_num);
    }
}

#ifdef ENABLE_EHCI
    static uint32_t ehci_UCMDR;
#endif

/**
  * @brief    Suspend USB Host Controller and devices
  * @return   None
  */
void usbh_suspend()
{
#ifdef ENABLE_EHCI
    int   time_out = 10;   /* ms */
#endif

#ifdef ENABLE_OHCI0
    uint32_t ohci0_HcControl_tamp = 0;

    /* port is hydra */
    /* set port suspend if connected */
    if (_ohci0->HcRhPortStatus[0] & USBH_HcRhPortStatus_CCS_Msk)
        _ohci0->HcRhPortStatus[0] = USBH_HcRhPortStatus_PSS_Msk;    /* set port suspend    */

    //    /* for Enhanced using */
    //    if (_ohci0->HcRhPortStatus[1] & USBH_HcRhPortStatus_CCS_Msk)
    //        _ohci0->HcRhPortStatus[1] = USBH_HcRhPortStatus_PSS_Msk;    /* set port suspend    */

    /* enable Device Remote Wakeup */
    _ohci0->HcRhStatus |= USBH_HcRhStatus_DRWE_Msk;

    /* enable USBH RHSC interrupt for system wakeup */
    _ohci0->HcInterruptEnable =  USBH_HcInterruptEnable_RHSC_Msk | USBH_HcInterruptEnable_RD_Msk;

    /* set Host Controller enter suspend state */
    ohci0_HcControl_tamp = _ohci0->HcControl;
    _ohci0->HcControl = ((ohci0_HcControl_tamp & ~USBH_HcControl_HCFS_Msk) | (3 << USBH_HcControl_HCFS_Pos));
#endif

#ifdef ENABLE_OHCI1
    uint32_t ohci1_HcControl_tamp = 0;

    /* port is Synopsys */
    /* set port suspend if deivce has been not connected */
    if ((_ohci1->HcRhPortStatus[0] & ~USBH_HcRhPortStatus_CCS_Msk) == 0)
        _ohci1->HcRhPortStatus[0] = USBH_HcRhPortStatus_PSS_Msk;    /* set port suspend    */

    //    /* for Enhanced using */
    //    if (_ohci1->HcRhPortStatus[1] & USBH_HcRhPortStatus_CCS_Msk)
    //        _ohci1->HcRhPortStatus[1] = USBH_HcRhPortStatus_PSS_Msk;    /* set port suspend    */

    /* enable Device Remote Wakeup */
    _ohci1->HcRhStatus |= USBH_HcRhStatus_DRWE_Msk;

    /* enable USBH RHSC interrupt for system wakeup */
    _ohci1->HcInterruptEnable =  USBH_HcInterruptEnable_RHSC_Msk | USBH_HcInterruptEnable_RD_Msk;

    /* set Host Controller enter suspend state */
    ohci1_HcControl_tamp = _ohci1->HcControl;
    _ohci1->HcControl = ((ohci1_HcControl_tamp & ~USBH_HcControl_HCFS_Msk) | (3 << USBH_HcControl_HCFS_Pos));
#endif

#ifdef ENABLE_EHCI
    ehci_UCMDR = _ehci->UCMDR;

    if (_ehci->UPSCR[0] & HSUSBH_UPSCR_PE_Msk)
    {
        _ehci->UPSCR[0] |= HSUSBH_UPSCR_SUSPEND_Msk;
        delay_us(2000);         /* wait 2 ms */
    }

    _ehci->UCMDR &= ~(HSUSBH_UCMDR_PSEN_Msk | HSUSBH_UCMDR_ASEN_Msk | HSUSBH_UCMDR_RUN_Msk);

    while (time_out > 0)
    {
        if (!(_ehci->UCMDR & HSUSBH_UCMDR_RUN_Msk) && (_ehci->USTSR & HSUSBH_USTSR_HCHalted_Msk))
        {
            break;
        }

